app/controllers/items_controller.rb

  def create
    @item = Item.create(params[:item])
---
INSERT INTO "items" ("created_at", "list_id", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Mon, 19 Nov 2012 02:11:58 UTC +00:00], ["list_id", nil], ["name", "Testing"], ["updated_at", Mon, 19 Nov 2012 02:11:58 UTC +00:00]]

  def destroy
    Item.find_by_list_id_and_id(params[:list_id], params[:id]).destroy
---
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 2]]
SELECT "items".* FROM "items" WHERE "items"."list_id" = 'ZA80XXrOD54rn5wfynJlfg' AND "items"."id" = 4 LIMIT 1